#2. По введенным пользователем координатам двух точек
# вывести уравнение прямой вида y = kx + b,
# проходящей через эти точки.


print("Введите координаты двух точек прямой")
x1 = float(input("координата X первой точки:"))
y1 = float(input("координата Y первой точки"))

x2 = float(input("координата X второй точки:"))
y2 = float(input("координата Y второй точки:"))

k = (y1 - y2) / (x1 - x2)
b = y2 - k * x2
print(f"Уравнение прямой:")
if b == 0:
    print(f"y = {k:.2f}*x")
elif b > 0:
    print(f"y = {k:.2f}*x + {b:.2f}")
else:
    print(f"y = {k:.2f}*x {b:.2f}")
